{
    "email": "a@gmail.com",
    "title": "Dr Nakarawa tells Tribunal he acted lawfully, and the suspension process was politically influenced",
    "summary": "The Constitutional Offices Commission Tribunal hearing allegations of misbehaviour against suspended Commissioner of the Fiji Corrections Service, Dr. Jalesi Nakarawa has been told that the suspended commissioner acted on his own accord and did not i...",
    "text": "The Constitutional Offices Commission Tribunal hearing allegations of misbehaviour against suspended Commissioner of the Fiji Corrections Service, Dr. Jalesi Nakarawa has been told that the suspended commissioner acted on his own accord and did not inform his line Minister about actions and policy changes he had implemented.\nTaking the witness stand, Dr. Nakarawa responded to all allegations previously raised before the Tribunal.\nReading from his affidavit, he stated that he believes the process leading to his suspension was flawed by political interference and a failure of due process.\nDr. Nakarawa said the allegations relate to what he maintains were the lawful exercise of his constitutional powers and fall short of the threshold of serious misconduct required to constitute “misbehaviour” under Section 137 of the Constitution.\nHe emphasised that he had at all times acted in good faith and in the best interests of the Fiji Corrections Service.\nHe told the tribunal that he was directed by the Minister for Justice, Siromi Turaga, on 7th January 2025 to proceed on extended leave pending investigation.\nHe argued that the Minister relied on a section of the Corrections Service Act that deals with inquiries into systemic issues—not the suspension of a constitutional office holder.\nDr. Nakarawa says he wrote back the next day, disputing the Minister’s authority and resuming duties to uphold the independence of his office.\nHe added that he subsequently provided comprehensive responses to the COC Secretariat on 10th February and again on 24th March regarding all complaints, detailing the lawful exercise of powers under Section 130 of the Constitution.\nAddressing claims of nepotism, Dr. Nakarawa said his wife applied for a nurse practitioner position, was shortlisted, interviewed, and appointed on merit.\nHe says FICAC investigated the matter and found no wrongdoing, confirming that standard protocols were followed and that she was the strongest candidate.\nHe also told the Tribunal he had no involvement in the appointments of his stepsons, Jeremaia and Inia Yavala, to the Corrections Service.\nWhen questioned by the Tribunal about the February drug tests conducted on officers, Dr. Nakarawa admitted he did not obtain consent.\nHe says he initiated the tests in an attempt to “clean up the organisation” from the effects of drugs.\nHe confirmed that MDMA appeared in Officer Adriano Bukavulo’s results, leading him to terminate Bukavulo’s employment.\nWhen pressed on whether he sought medical advice, including information about false positive or false negative results, he said he relied on his own research that identified MDMA as an illegal drug.\nThe Tribunal noted that it appeared Dr. Nakarawa was acting without professional medical advice and reminded him that individuals have a constitutional right to give consent for any medical testing.\nThe hearing has been adjourned to 1st December, and the Tribunal is expected to table its final report on 17th December.",
    "gemini_percent": "85",
    "model_label": "Fake",
    "url": ""
}