{
    "email": "a@gmail.com",
    "title": "Amazon to invest up to $50B to build AI infrastructure for US government agencies",
    "summary": "AWS announced an investment of up to $50 billion to build AI and supercomputing infrastructure for U.S. government agencies starting in 2026 through a new initiative.",
    "text": "EXCLUSIVE: Amazon Web Services (AWS) on Monday announced a plan to build and deploy purpose-built artificial intelligence (AI) and high-performance computing for the U.S. government for the first time. AWS&apos; announcement includes a commitment to invest up to $50 billion to expand the AI and supercomputing abilities available to the company&apos;s customers in the federal government. The investment is set to begin in 2026 and will add nearly 1.3 gigawatts of AI and supercomputing capacity across AWS Top Secret, AWS Secret and AWS GovCloud (US) Regions by building data centers with advanced compute and networking technologies. \"Our investment in purpose-built government AI and cloud infrastructure will fundamentally transform how federal agencies leverage supercomputing,\" said AWS CEO Matt Garman. \"We&apos;re giving agencies expanded access to advanced AI capabilities that will enable them to accelerate critical missions from cybersecurity to drug discovery.\" AMAZON ROBOTICS CHIEF: &apos;I WANT TO ELIMINATE EVERY MENIAL, MUNDANE JOB&apos; AS AI RESHAPES WAREHOUSE WORK \"This investment removes the technology barriers that have held government back and further positions America to lead in the AI era,\" Garman added. Federal agencies will receive access to AWS&apos; comprehensive AI services, including Amazon SageMaker AI for model training and customization, Amazon Bedrock for model and agent deployment, Anthropic Claude, Amazon Nova, as well as AWS Trainium AI chips and Nvidia AI infrastructure. AMAZON STOCK HITS RECORD, LIGHTS UP ETFS AWS&apos; initiative aims to accelerate discovery and decision-making across government missions, with AI-powered simulation and modeling data enabling agencies to accomplish tasks in hours that previously took weeks or months. For example, AWS said the investment will allow research teams to process decades of global security data across hundreds of variables in real-time to turn pattern analysis into immediately actionable insights. It also said that AI and supercomputing can take defense and intelligence workflows that require weeks of manual analysis and allow them to automatically detect threats and generate response plans through processing satellite imagery, sensor data and historical patterns at an unprecedented scale. AMAZON UNVEILS HIGH-TECH EYEGLASSES, AI TO BOOST EFFICIENCY OF DELIVERIES The company said the investment supports the White House&apos;s AI Action Plan, along with other advanced computing initiatives deployed in secure, U.S.-based AI and cloud infrastructure. AWS provides support to over 11,000 government agencies since it launched its government cloud solutions over a decade ago. The company built the first infrastructure specifically for government security and compliance requirements in 2011 with AWS GovCloud (US-West). GET FOX BUSINESS ON THE GO BY CLICKING HERE It also created the first air-gapped commercial cloud accredited to support classified workloads in 2014, and became the first cloud provider accredited across all U.S. government data classifications – unclassified, secret and top secret – in 2017 when it launched AWS Secret Region.",
    "publish_date": "2025-11-24 16:00:39",
    "country": "null",
    "gemini_percent": "95",
    "model_label": "True",
    "url": ""
}